saved_forms/.svn/text-base/Vidya382.xml.svn-base

<?xml version="1.0" encoding="utf-8" ?>

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"

    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"

    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

  <env:Body>

    <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">

      <RequestDateTime xsi:nil="true"></RequestDateTime>

      <StoreID xsi:nil="true"></StoreID>

      <RequestType>LIVE</RequestType>

      <orderRequest>

        <OrderID>1234</OrderID>

        <OrderDate>03/18/2009 9:00</OrderDate>

        <Channel>POS</Channel>

        <Brand>Gap Outlet</Brand>

        <Market>Canada</Market>

        <OrderLineItems>

          <SequenceNumber>0</SequenceNumber>

          <Product>

            <Brand>Gap Outlet</Brand>

            <Sku>1230005014</Sku>

            <ItemCorpNumber>1</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>16</ItemDivisionNumber>

            <ItemDepartmentNumber>168</ItemDepartmentNumber>

            <ItemClassNumber>07</ItemClassNumber>

            <ItemSubClassNumber>03</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>39.99</NetPrice>

            <PriceType>PROMOTION</PriceType>

          </Price>

          <Quantity>1</Quantity>

        </OrderLineItems>

        <OrderLineItems>

          <SequenceNumber>1</SequenceNumber>

          <Product>

            <Brand>Gap Outlet</Brand>

            <Sku>1230005015</Sku>

            <ItemCorpNumber>01</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>16</ItemDivisionNumber>

            <ItemDepartmentNumber>163</ItemDepartmentNumber>

            <ItemClassNumber>05</ItemClassNumber>

            <ItemSubClassNumber>01</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>45.99</NetPrice>

            <PriceType>PROMOTION</PriceType>

          </Price>

          <Quantity>1</Quantity>

        </OrderLineItems>

        <OrderLineItems>

          <SequenceNumber>2</SequenceNumber>

          <Product>

            <Brand>Gap Outlet</Brand>

            <Sku>1230005016</Sku>

            <ItemCorpNumber>01</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>16</ItemDivisionNumber>

            <ItemDepartmentNumber>163</ItemDepartmentNumber>

            <ItemClassNumber>16</ItemClassNumber>

            <ItemSubClassNumber>00</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>15.97</NetPrice>

            <PriceType>MARKDOWN</PriceType>

          </Price>

          <Quantity>1</Quantity>

        </OrderLineItems>

        <Promotions>

          <SequenceNumber>0</SequenceNumber>

          <PromotionCode>BB4FYG3YMZHT</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>1</SequenceNumber>

          <PromotionCode>MPKB7XM4MNPQ</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>2</SequenceNumber>

          <PromotionCode>B6KXF6MT12RG</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>3</SequenceNumber>

          <PromotionCode>BF1XL7L9DKJY</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>4</SequenceNumber>

          <PromotionCode>DG2FLLHHVW6W</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>5</SequenceNumber>

          <PromotionCode>D6MTDMLLPBKJ</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>6</SequenceNumber>

          <PromotionCode>BWRHBBZD49L1</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <MaxDiscountsAllowed>1</MaxDiscountsAllowed>

      </orderRequest>

    </n1:DiscountServiceRequest>

  </env:Body>

</env:Envelope>

 

 

<?xml version="1.0" encoding="utf-8" ?>

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"

    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"

    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

  <env:Body>

    <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">

      <RequestDateTime xsi:nil="true"></RequestDateTime>

      <StoreID xsi:nil="true"></StoreID>

      <RequestType>LIVE</RequestType>

      <orderRequest>

        <OrderID>1234</OrderID>

        <OrderDate>03/18/2009 9:00</OrderDate>

        <Channel>POS</Channel>

        <Brand>Banana Republic</Brand>

        <Market>USA</Market>

        <OrderLineItems>

          <SequenceNumber>0</SequenceNumber>

          <Product>

            <Brand>Banana Republic</Brand>

            <Sku>1230005021</Sku>

            <ItemCorpNumber>11</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>22</ItemDivisionNumber>

            <ItemDepartmentNumber>221</ItemDepartmentNumber>

            <ItemClassNumber>04</ItemClassNumber>

            <ItemSubClassNumber>03</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>37.5</NetPrice>

            <PriceType>REGULAR</PriceType>

          </Price>

          <Quantity>1</Quantity>

          <ManualDiscountApplied>1</ManualDiscountApplied>

        </OrderLineItems>

        <OrderLineItems>

          <SequenceNumber>1</SequenceNumber>

          <Product>

            <Brand>Banana Republic</Brand>

            <Sku>1230005022</Sku>

            <ItemCorpNumber>11</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>13</ItemDivisionNumber>

            <ItemDepartmentNumber>131</ItemDepartmentNumber>

            <ItemClassNumber>04</ItemClassNumber>

            <ItemSubClassNumber>01</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>17.5</NetPrice>

            <PriceType>REGULAR</PriceType>

          </Price>

          <Quantity>1</Quantity>

          <ManualDiscountApplied>1</ManualDiscountApplied>

        </OrderLineItems>

        <OrderLineItems>

          <SequenceNumber>2</SequenceNumber>

          <Product>

            <Brand>Banana Republic</Brand>

            <Sku>1230005023</Sku>

            <ItemCorpNumber>11</ItemCorpNumber>

            <ItemCompanyNumber>1</ItemCompanyNumber>

            <ItemDivisionNumber>13</ItemDivisionNumber>

            <ItemDepartmentNumber>132</ItemDepartmentNumber>

            <ItemClassNumber>02</ItemClassNumber>

            <ItemSubClassNumber>02</ItemSubClassNumber>

            <MerchandiseType>7</MerchandiseType>

          </Product>

          <Price>

            <NetPrice>24.97</NetPrice>

            <PriceType>REGULAR</PriceType>

          </Price>

          <Quantity>1</Quantity>

        </OrderLineItems>

        <Promotions>

          <SequenceNumber>0</SequenceNumber>

          <PromotionCode>BB4FYG3YMZHT</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>1</SequenceNumber>

          <PromotionCode>B6KXF6MT12RG</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>2</SequenceNumber>
 
          <PromotionCode>BF1XL7L9DKJY</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <Promotions>

          <SequenceNumber>3</SequenceNumber>

          <PromotionCode>MPKB7XM4MNPQ</PromotionCode>

          <ReceiptMessages></ReceiptMessages>

          <PromoUsages></PromoUsages>

          <QualifyingTenders xsi:nil="true"></QualifyingTenders>

        </Promotions>

        <MaxDiscountsAllowed>2</MaxDiscountsAllowed>

      </orderRequest>

    </n1:DiscountServiceRequest>

  </env:Body>

</env:Envelope>